app/controllers/songs_controller.rb

INSERT INTO "songs" ("name", "artist", "album") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Vultures"], ["artist", "John Mayer"], ["album", "Continuum"]]
---
    def create
        @song = Song.new(song_params)

        respond_to do |format|
            if @song.save